<?php

namespace Database\Seeders;

use App\Models\StaticPage;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class StaticPagesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        $pages = [
            [
                'key' => 'who-are-we',
                'content' => json_encode([
                    "intro" => "نحن مقدم رائد للحلول المبتكرة.",
                    "description" => "تطبيق \"يمتاز\" يعد المنصة الأمثل لتوفير الحلول التقنية والوسائل الإلكترونية لخدمات واستشارات القانونية في المملكة العربية السعودية. يتمتع التطبيق بميزة فريدة تجمع بين التكنولوجيا الحديثة والخبرة القانونية العميقة، بمشاركة نخبة من المحامين والمحاميات المرخصين رسمياً من قبل وزارة العدل السعودية مع كادر من المستشارين المتخصصين بمختلف فروع القانون وبأكثر من لغة حية.

هدف \"يمتاز\" هو تسهيل عملية الوصول إلى الاستشارات القانونية عبر واجهة مستخدم بسيطة التفاصيل وسهلة الاستخدام .
يمكن للمستخدمين البحث بسهولة عن الخدمات القانونية المناسبة لاحتياجاتهم وحجز مواعيد الاستشارات المتنوعة مع المتخصصين بكل يسر وسهولة.

⚖ يقدم \"يمتاز\" ضماناً تاماً لجودة الخدمة ومصداقيتها، حيث يتم التأكد من أن جميع الاستشارات تتم على يد محامين ومحاميات مؤهلين ومرخصين رسمياً. كما يحرص التطبيق على توفير بيئة آمنة ومأمونة للمستخدمين، حيث يتم حفظ جميع المعلومات بشكل آمن وتشفير جميع المعاملات والتواصل داخل التطبيق.

🌟 بفضل مزيجه المتميز من التكنولوجيا الحديثة والخبرة القانونية، يعد \"يمتاز\" الخيار الأمثل لمن يبحثون عن حلول قانونية موثوقة وفعّالة في المملكة العربية السعودية. سواء كنت تبحث عن استشارة شخصية أو خدمة قانونية لعملك، فإن \"يمتاز\" سيوفر لك التجربة الأمثل وسيسهل لك الوصول إلى الخدمات القانونية بكل يسر وسهولة.",
                    "servicesCount" => 20,
                    "clients" => "1000",
                    "countries" => 10
                ])
            ],
            [
                'key' => 'terms-and-conditions',
                'content' => json_encode([
                    "data" => 'هذه الشروط والأحكام تحكم استخدامك لخدماتنا. من خلال الوصول إلى خدماتنا أو استخدامها، فإنك توافق على الالتزام بهذه الشروط. نحتفظ بالحق في تحديث هذه الشروط في أي وقت، وستكون هذه التغييرات سارية فور نشرها.',
                    'updated_at' => '2024-08-21 10:00:00'
                ])
            ],
            [
                'key' => 'privacy-policy',
                'content' => json_encode([
                    "intro" => 'خصوصيتك مهمة لنا. توضح سياسة الخصوصية هذه كيفية جمع واستخدام وحماية معلوماتك الشخصية.',
                    "description" => 'نقوم بجمع المعلومات الشخصية لتقديم خدماتنا وتحسينها. نحن ملتزمون بضمان أمان بياناتك ولن نستخدمها إلا وفقًا لهذه السياسة.'
                ])
            ],
            [
                'key' => 'social-media',
                'content' => json_encode([
                    [
                        'url' => 'https://www.facebook.com',
                        'name' => 'facebook',
                        "logo" => 'https://api.ymtaz.sa/logos/FacebookLogo.png'
                    ],
                    [
                        'url' => 'https://www.x.com',
                        'name' => 'x',
                        "logo" => 'https://api.ymtaz.sa/logos/XLogo.png'
                    ],
                    [
                        'url' => 'https://www.instagram.com',
                        'name' => 'instagram',
                        "logo" => 'https://api.ymtaz.sa/logos/InstagramLogo.png'
                    ],
                    [
                        'url' => 'https://www.whatsapp.com',
                        'name' => 'whatsapp',
                        "logo" => 'https://api.ymtaz.sa/logos/WhatsappLogo.png'
                    ],
                    [
                        "url" => "https://www.snapchat.com",
                        "name" => "snapchat",
                        "logo" => 'https://api.ymtaz.sa/logos/SnapchatLogo.png'
                    ]
                ])
            ],
            [
                'key' => 'faq',
                'content' => json_encode([
                    [
                        "title" => "ما هي هذه الخدمة؟",
                        "data" => "هذه خدمة شاملة توفر مجموعة من الحلول المصممة لتلبية احتياجاتك الخاصة. سواء كنت تبحث عن دعم فني أو استشارات أو تطوير منتجات، نحن هنا لتلبية احتياجاتك."
                    ],
                    [
                        "title" => "كيف يمكنني التسجيل؟",
                        "data" => "التسجيل سهل! فقط انقر على زر 'التسجيل' في أعلى الصفحة، أدخل تفاصيلك، وستكون جاهزًا لبدء استخدام خدماتنا في أي وقت."
                    ],
                    [
                        "title" => "ما هي الفوائد؟",
                        "data" => "تشمل فوائد خدمتنا الوصول إلى مجموعة واسعة من الموارد، والدعم الشخصي، وإمكانية تخصيص حلولنا لتناسب احتياجاتك الخاصة."
                    ]
                ])
            ],

        ];
        StaticPage::truncate();

        foreach ($pages as $page) {
            StaticPage::create($page);
        }
    }
}
